tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'dos2unix'
brew 'git'
brew 'go'
brew 'grip'
brew 'imagemagick'
brew 'mariadb'
brew 'mas'
brew 'p7zip'
brew 'packer'
brew 'pstree'
brew 'rbenv'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'unrar'
brew 'watch'
brew 'wget'

brew 'bash-completion'
brew 'bundler-completion'
brew 'packer-completion'
brew 'vagrant-completion'

cask 'caskroom/fonts/font-menlo-for-powerline'
cask 'appcleaner'
cask 'cyberduck'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'spotify'
#cask 'steam'
cask 'telegram-desktop'
cask 'textmate'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
#cask 'xquartz'

mas '1Password', id: 443987910
mas 'Alfred', id: 405843582
mas 'BetterSnapTool', id: 417375580
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'GarageBand', id: 682658836
mas 'iFinance 4', id: 992362138
mas 'iMovie', id: 408981434
#mas 'iMovie 9.0.9', id: 408981434
mas 'Logic Pro X', id: 634148309
mas 'Mactracker', id: 430255202
mas 'Microsoft Remote Desktop', id: 715768417
mas 'OneDrive', id: 823766827
mas 'Purple Tree', id: 764936294
mas 'Remote Desktop', id: 409907375
mas 'SystemPal', id: 453164367

