tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-cask'
tap 'homebrew/cask-fonts'
tap 'puppetlabs/puppet'

brew 'ack'
brew 'coreutils'
brew 'dos2unix'
brew 'git'
brew 'go'
brew 'grip'
brew 'hub'
brew 'imagemagick'
brew 'mas'
brew 'p7zip'
brew 'packer'
brew 'pstree'
brew 'rbenv'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'ssh-copy-id'
brew 'tig'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'unrar'
brew 'watch'
brew 'wget'

# LAMP
brew 'openldap'
brew 'libiconv'
brew 'apache2'
brew 'php@7.2'
brew 'phpmyadmin'
cask 'sequel-pro'
brew 'mariadb'

# Completions
brew 'bash-completion'
brew 'bundler-completion'
brew 'packer-completion'
brew 'vagrant-completion'

# Casks
cask 'font-menlo-for-powerline'
cask 'alfred'
cask 'appcleaner'
#cask 'cyberduck'
cask 'dropbox'
cask 'google-chrome'
cask 'guitar-pro'
cask 'iina'
brew 'youtube-dl'
cask 'iterm2'
cask 'java'
cask 'miniconda'
cask 'pdk'
cask 'puppet-agent-6'
#cask 'slack'
cask 'spotify'
#cask 'steam'
cask 'telegram-desktop'
cask 'textmate'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'xquartz'

mas '1Password', id: 443987910
mas 'Alfred', id: 405843582
mas 'BetterSnapTool', id: 417375580
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'GarageBand', id: 682658836
mas 'iFinance 4', id: 992362138
mas 'iMovie', id: 408981434
#mas 'iMovie 9.0.9', id: 408981434
mas 'Logic Pro X', id: 634148309
mas 'Mactracker', id: 430255202
mas 'Microsoft Remote Desktop 10', id: 1295203466
mas 'OneDrive', id: 823766827
mas 'Purple Tree', id: 764936294
mas 'Remote Desktop', id: 409907375
mas 'SystemPal', id: 453164367
